package com.ifmo.lesson5;

public class Lesson5 {
    //  хэширование данных

    // алгоритмы рассчета хэш кода

    // equals(Object o) для сравнения объектовю Возвращает тру или фолс
    // сравнивает являются ли объекты ссылками на один объект

    // для сравнения нужно использовать и иквелс и хэш

    // почитать про класс Object

    // переопределение, коллекции, листы

    // инстансофф - принадлежность объекта к классу

    //метод getclass

    // метод clone() - создает копию объекта
    // Message m1 = (Message) m1.clone();
    // чтобы им пользоваться, его нужно переопределить в классе мэсэдж
    // класс мэсэдж должен содержать implements Cloneable; и реализовывать метод клон
    // почитать про клон

    //списки

    //  инициализация

    // @Override

    // многопоточность

    //перебор листа
    // for (Object 0: List) {
    //  System.out.println(o);
    // }


    // абстрактные классы

    //вложенные классы, статические и нестатические

    // статик и финал

    // instance

}
